DataProcessors/ПлатежныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПлатежныйКалендарь</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДнейПланирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланироватьСДаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодовДолгосрочногоПланирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьДолгосрочногоПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПланированияПоДням</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДолгосрочногоПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьВыходные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеревоПлатежей</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесогласованныеЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказыКлиентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказыПоставщикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратыКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратыОтПоставщиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаИтогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьПоВалютам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборОрганизации</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборБанковскиеСчетаКассы</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНераспределенныеПоСчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрСчетовКалендаря</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХранилищаМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитыИлиЗаймыПолученные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депозиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаймыВыданные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аренда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыеПоступления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаДереваПлатежей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НулевыеОстаткиИОбороты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкиОтчета</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикОтбор</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаОтображенияПросроченныхПлатежей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьДокументыПриСоздании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ГрафикПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГрафикПлатежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиПланированияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальностиГрафика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПретензийКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаВозвратТоваровОтКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыТаможенныхДеклараций</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровКонтрагентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовПоставщикам</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокСотрудников</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыРеализацийТоваровУслуг</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыАктовПремийКлиентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заморожен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныйБанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходнаяДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлательщикПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСуммГрафикаКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоступлениеСписание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПлатежныйКалендарь/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Добавляет команду создания объекта.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  - СтрокаТаблицыЗначений - строка данных, определяющая параметры команды ввода на основании.
//  - Неопределено - если нет права на создание документа "Списание безналичных ДС".
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.СписаниеБезналичныхДенежныхСредств) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Обработки.ПлатежныйКалендарь.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = НСтр("ru= 'Сформировать списания ДС...'") ;
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.Картинка = БиблиотекаКартинок.ОформитьПродажу;
	
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Определяет банковские счета и кассы, с которых может быть произведен платеж по объекту оплаты
// 
// Параметры:
//  Платежи - СписокЗначений из Строка, ДокументСсылка.ЗаявканаРасходованиеДенежныхСредств.
//  Исключительные - Булево - Признак включения всех доступных счетов и касс, либо их разбиения по заявкам
//
// Возвращаемое значение:
//  - Массив из СправочникСсылка.БанковскиеСчетаОрганизаций, СправочникСсылка.Кассы
//  - Соответствие Из КлючИЗначение:
//     * Ключ - ДокументСсылка.ЗаявканаРасходованиеДенежныхСредств, Строка - Способ идентификации записи в графике платежей.
//     * Значение - Массив из СправочникСсылка.БанковскиеСчетаОрганизаций, СправочникСсылка.Кассы.
//
Функция БанковскиеСчетаКассыДоступныеДляОбъектаОплаты(Платежи, Исключительные = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Платежи.Количество() = 1
		И ТипЗнч(Платежи[0].Значение) = Тип("ДокументСсылка.ЗаявканаРасходованиеДенежныхСредств") Тогда
		Заявки = Новый Массив;
		Заявки.Добавить(Платежи[0].Значение);
		ИдентификаторыНеЗаявки = Новый Массив;
	Иначе
		ДанныеПлатежей = ДанныеПлатежейПоИдентификаторам(Платежи);
		Заявки = ДанныеПлатежей.ЗаявкиНаОплату;
		ИдентификаторыНеЗаявки = ДанныеПлатежей.ИдентификаторыНеЗаявки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Заявка.Ссылка КАК Заявка,
	|	БанковскиеСчета.Ссылка КАК БанковскийСчетКасса
	|ПОМЕСТИТЬ ВсеБанковскиеСчетаКассы
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчета
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|	ПО
	|		Заявка.Организация = БанковскиеСчета.Владелец
	|ГДЕ
	|	Заявка.Ссылка В (&Ссылка)
	|	И Заявка.ФормаОплатыБезналичная
	|	И НЕ БанковскиеСчета.ПометкаУдаления
	|	И НЕ БанковскиеСчета.Закрыт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заявка.Ссылка,
	|	Кассы.Ссылка
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|	ПО
	|		Заявка.Организация = Кассы.Владелец
	|		И (Кассы.ВалютаДенежныхСредств = Заявка.Валюта
	|				И (Заявка.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа)
	|					ИЛИ Заявка.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ПустаяСсылка))
	|			ИЛИ Заявка.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов))
	|		И (Кассы.ВалютаДенежныхСредств = Заявка.КассаПолучатель.ВалютаДенежныхСредств
	|			ИЛИ Заявка.КассаПолучатель = ЗНАЧЕНИЕ(Справочник.Кассы.ПустаяСсылка)
	|		И Заявка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты)
	|		ИЛИ
	|		Кассы.ВалютаДенежныхСредств = Заявка.Валюта
	|			И Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КонвертацияВалюты))
	|ГДЕ
	|	Заявка.Ссылка В (&Ссылка)
	|	И НЕ Кассы.ПометкаУдаления
	|	И Заявка.ФормаОплатыНаличная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлатежиНеЗаявки.Идентификатор,
	|	БанковскиеСчета.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчета
	|	
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ГрафикПлатежей КАК ПлатежиНеЗаявки
	|ПО
	|	  ПлатежиНеЗаявки.Организация = БанковскиеСчета.Владелец
	|	И ПлатежиНеЗаявки.Идентификатор В (&ИдентификаторыНеЗаявки)
	|ГДЕ
	|	  НЕ БанковскиеСчета.ПометкаУдаления
	|	И НЕ БанковскиеСчета.Закрыт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлатежиНеЗаявки.Идентификатор,
	|	Кассы.Ссылка
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|	
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ГрафикПлатежей КАК ПлатежиНеЗаявки
	|ПО
	|	  ПлатежиНеЗаявки.Организация = Кассы.Владелец
	|	И ПлатежиНеЗаявки.Идентификатор В (&ИдентификаторыНеЗаявки)
	|ГДЕ
	|	НЕ Кассы.ПометкаУдаления
	|;
	|
	|///////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеБанковскиеСчетаКассы.БанковскийСчетКасса
	|ИЗ
	|	ВсеБанковскиеСчетаКассы КАК ВсеБанковскиеСчетаКассы
	|;
	|
	|///////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеБанковскиеСчетаКассы.Заявка,
	|	ВсеБанковскиеСчетаКассы.БанковскийСчетКасса
	|ИЗ
	|	ВсеБанковскиеСчетаКассы КАК ВсеБанковскиеСчетаКассы
	|ИТОГИ ПО
	|	ВсеБанковскиеСчетаКассы.Заявка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Заявки);
	Запрос.УстановитьПараметр("ИдентификаторыНеЗаявки", ИдентификаторыНеЗаявки);
	
	Если Исключительные Тогда
		Возврат Запрос.ВыполнитьПакет()[1].Выгрузить().ВыгрузитьКолонку("БанковскийСчетКасса");
	Иначе
		ЗначенияБанковскихСчетовКасс = Новый Соответствие;
		Выборка = Запрос.ВыполнитьПакет()[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			СчетаКассыЗаявки = Новый Массив;
			ВыборкаСчетовКасс = Выборка.Выбрать();
			Пока ВыборкаСчетовКасс.Следующий() Цикл
				СчетаКассыЗаявки.Добавить(ВыборкаСчетовКасс.БанковскийСчетКасса);
			КонецЦикла;
			ЗначенияБанковскихСчетовКасс.Вставить(Выборка.Заявка, СчетаКассыЗаявки);
		КонецЦикла;
		Возврат ЗначенияБанковскихСчетовКасс;
	КонецЕсли;
	
КонецФункции

// Структура переноса объекта оплаты.
// 
// Возвращаемое значение:
//  Структура - Структура переноса заявки:
//   * ОбъектОплаты - ОпределяемыйТип.ОбъектОплаты.
//   * БанковскийСчетКасса - СправочникСсылка.БанковскиеСчетаОрганизаций, СправочникСсылка.Кассы.
//   * ДатаПлатежа - Дата.
//   * ПлательщикПолучатель - СправочникСсылка.Организации, СправочникСсылка.Контрагенты, СправочникСсылка.ФизическиеЛица.
//   * Организация - СправочникСсылка.Организации.
//   * ТипСуммы - ПеречислениеСсылка.ТипыСуммГрафикаКредитовИДепозитов, ПеречислениеСсылка.ВидыПереводовДенежныхСредств, 
//   	ПеречислениеСсылкаПеречислениеСсылка.ТипыПлатежейПоАренде.
//   * ПоступлениеСписание - ПеречислениеСсылка.ТипыДвиженияДенежныхСредств.
//   * Валюта - СправочникСсылка.Валюты
//   * ИсходныйБанковскийСчетКасса - СправочникСсылка.БанковскиеСчетаОрганизаций, СправочникСсылка.Кассы.
//   * ИсходнаяДатаПлатежа  - Дата.
//   * ИсходнаяСумма - Число.
//   * СуммаПереноса - Число.
//   * Коэффициент - Число.
//   * ВалютаПереноса - СправочникСсылка.Валюты
//   * ФлагЗакрыть - Булево.
//   * ЭтоРазбиение - Булево. 
//
Функция СтруктураПереноса() Экспорт
	
	СтруктураПереноса = Новый Структура;
	
	СтруктураПереноса.Вставить("ОбъектОплаты");
	СтруктураПереноса.Вставить("БанковскийСчетКасса");
	СтруктураПереноса.Вставить("ДатаПлатежа");
	СтруктураПереноса.Вставить("ПлательщикПолучатель");
	СтруктураПереноса.Вставить("Организация");
	СтруктураПереноса.Вставить("ТипСуммы");
	СтруктураПереноса.Вставить("ПоступлениеСписание");
	СтруктураПереноса.Вставить("Валюта");
	
	СтруктураПереноса.Вставить("ИсходныйБанковскийСчетКасса");
	СтруктураПереноса.Вставить("ИсходнаяДатаПлатежа");
	СтруктураПереноса.Вставить("ИсходнаяСумма");
	
	СтруктураПереноса.Вставить("СуммаПереноса");
	СтруктураПереноса.Вставить("Коэффициент");
	СтруктураПереноса.Вставить("ВалютаПереноса");
	СтруктураПереноса.Вставить("ФлагЗакрыть");
	
	СтруктураПереноса.Вставить("ЭтоРазбиение", Ложь);

	Возврат СтруктураПереноса;
	
КонецФункции

Процедура ПеренестиОбъектыОплаты(Параметры, АдресРезультата) Экспорт
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
		"ПланированиеИКонтрольДенежныхСредств.ПереносЗаявокНаРасходованиеДенежныхСредствВПлатежномКалендаре");
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеПереноса = Параметры.ДанныеПереноса;
	ПланироватьСДаты = Параметры.ПланироватьСДаты;
	
	ПеренесенныеОбъектыОплаты = Новый Соответствие;
	
	НачатьТранзакцию();
	
	Попытка
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ.ЗаявкаНаРасходованиеДенежныхСредств");
		
		Для Каждого ОбъектОплаты Из ДанныеПереноса Цикл
			
			Если ТипЗнч(ОбъектОплаты.Ключ) = Тип("Строка") Тогда
				ПеренестиОбъектОплаты(ОбъектОплаты, ПланироватьСДаты);
				ПеренесенныеОбъектыОплаты.Вставить(ОбъектОплаты.Ключ, ОбъектОплаты.Значение);
				Продолжить;
			КонецЕсли;
			
			ЗаявкаОбъект = ОбъектОплаты.Ключ.ПолучитьОбъект();
			
			Попытка
				ЗаявкаОбъект.Заблокировать();
			Исключение
				ТекстСообщения = СтрШаблон(
					НСтр("ru = '%1 находится в процессе редактирования пользователем или системой и не может быть изменена.'"),
					ЗаявкаОбъект);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецПопытки;
			
			МожноМенятьЖелаемуюДату = Истина;
			
			Для Каждого ЭлементПереноса Из ОбъектОплаты.Значение Цикл
				
				Если ЭлементПереноса.Коэффициент > 0 Тогда
				
					Если ЗначениеЗаполнено(ЭлементПереноса.БанковскийСчетКасса) Тогда
						
						МожноМенятьЖелаемуюДату = Ложь;
						
						Если ЭлементПереноса.ДатаПлатежа >= ПланироватьСДаты Тогда
							
							СтруктураПоиска = Новый Структура("БанковскийСчетКасса, ДатаПлатежа");
							ЗаполнитьЗначенияСвойств(СтруктураПоиска, ЭлементПереноса);
							
							СуммаУменьшения = ЭлементПереноса.СуммаПереноса;
							
							НайденныеСтроки = ЗаявкаОбъект.РаспределениеПоСчетам.НайтиСтроки(СтруктураПоиска);
							
							Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
								
								СуммаПоСтроке = Мин(СуммаУменьшения, НайденнаяСтрока.Сумма);
								НайденнаяСтрока.Сумма = НайденнаяСтрока.Сумма - СуммаПоСтроке;
								СуммаУменьшения = СуммаУменьшения - СуммаПоСтроке;
								Если Не НайденнаяСтрока.Сумма Тогда
									ЗаявкаОбъект.РаспределениеПоСчетам.Удалить(НайденнаяСтрока);
								КонецЕсли;
								Если Не СуммаУменьшения Тогда
									Прервать;
								КонецЕсли;
							КонецЦикла;
						Иначе
							СтрокиКУдалению = Новый Массив;
							СуммаРазницы = ЭлементПереноса.СуммаПереноса;
							
							Для каждого СтрокаРаспределения Из ЗаявкаОбъект.РаспределениеПоСчетам Цикл
								
								Если СтрокаРаспределения.БанковскийСчетКасса = ЭлементПереноса.БанковскийСчетКасса Тогда
									Если СтрокаРаспределения.Сумма = ЭлементПереноса.СуммаПереноса Тогда
										СтрокиКУдалению.Добавить(СтрокаРаспределения);
										Прервать;
									ИначеЕсли СтрокаРаспределения.Сумма > СуммаРазницы Тогда
										СтрокаРаспределения.Сумма = СтрокаРаспределения.Сумма - СуммаРазницы;
										Прервать;
									Иначе
										СтрокиКУдалению.Добавить(СтрокаРаспределения);
										СуммаРазницы = СуммаРазницы - СтрокаРаспределения.Сумма;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
							
							Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
								ЗаявкаОбъект.РаспределениеПоСчетам.Удалить(СтрокаКУдалению);
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если ЗначениеЗаполнено(ЭлементПереноса.БанковскийСчетКасса) Тогда
						
						НоваяСтрокаРаспределения = ЗаявкаОбъект.РаспределениеПоСчетам.Добавить();
						НоваяСтрокаРаспределения.БанковскийСчетКасса = ЭлементПереноса.БанковскийСчетКасса;
						НоваяСтрокаРаспределения.Сумма = ЭлементПереноса.СуммаПереноса;
						Если ЗначениеЗаполнено(ЭлементПереноса.ДатаПлатежа) Тогда
							НоваяСтрокаРаспределения.ДатаПлатежа = ЭлементПереноса.ДатаПлатежа;
						Иначе
							НоваяСтрокаРаспределения.ДатаПлатежа = ЗаявкаОбъект.ЖелательнаяДатаПлатежа;
						КонецЕсли;
					Иначе
						Если ЗначениеЗаполнено(ЭлементПереноса.ДатаПлатежа) Тогда
							Если МожноМенятьЖелаемуюДату Тогда
								ЗаявкаОбъект.ЖелательнаяДатаПлатежа = ЭлементПереноса.ДатаПлатежа;
							Иначе
								ЭлементПереноса.ДатаПлатежа = ЗаявкаОбъект.ЖелательнаяДатаПлатежа;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если ЭлементПереноса.ФлагЗакрыть Тогда
				Если ЭлементПереноса.Коэффициент = 1 Тогда
					ЗаявкаОбъект.Разблокировать();
					Если МенеджерДокумента.ЗакрытьЗаявки(ОбъектОплаты.Ключ) = 1 Тогда
						ПеренесенныеОбъектыОплаты.Вставить(ОбъектОплаты.Ключ, ОбъектОплаты.Значение);
					КонецЕсли;
				ИначеЕсли ЭлементПереноса.Коэффициент = -1 Тогда
					ЗаявкаОбъект.Закрыта = Ложь;
					ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
					ПеренесенныеОбъектыОплаты.Вставить(ОбъектОплаты.Ключ, ОбъектОплаты.Значение);
				КонецЕсли;
			Иначе
				Если ЗаявкаОбъект.ПроверитьЗаполнение() Тогда
					ЗаявкаОбъект.Записать();
					
					Таблицы = ПроведениеДокументов.ДанныеДокументаДляПроведения(ЗаявкаОбъект.Ссылка, "ДенежныеСредстваКВыплате");
					
					НаборЗаписей = РегистрыНакопления.ДенежныеСредстваКВыплате.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Регистратор.Установить(ЗаявкаОбъект.Ссылка);
					НаборЗаписей.Загрузить(Таблицы["Таблица"+"ДенежныеСредстваКВыплате"]);
					НаборЗаписей.Записать();
					
					ПеренесенныеОбъектыОплаты.Вставить(ОбъектОплаты.Ключ, ОбъектОплаты.Значение);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Не удалось перенести заявки по причине: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		ТекстОшибки = НСтр("ru = 'Не удалось перенести заявки.'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(
			ТекстОшибки,
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
		ПеренесенныеОбъектыОплаты.Очистить();
	КонецПопытки;
	
	ПоместитьВоВременноеХранилище(ПеренесенныеОбъектыОплаты, АдресРезультата);
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, ПеренесенныеОбъектыОплаты.Количество());
	
КонецПроцедуры

// Получает конечную дату по переданной начальной дате и количеству дней.
// 
// Параметры:
//  ПланироватьСДаты - Дата
//  ДнейПланирования - Число
// 
// Возвращаемое значение:
//  Дата
//
Функция ДатаОкончанияПланированияПоДням(Знач ПланироватьСДаты, Знач ДнейПланирования) Экспорт
	
	Возврат ПланироватьСДаты + 86400 * (ДнейПланирования - 1);
	
КонецФункции

// Получает конечную дату долгосрочного планирования.
// 
// Параметры:
//  ДатаОкончанияПланированияПоДням - Дата
//  ПериодовДолгосрочногоПланирования - Число
//  ПериодичностьДолгосрочногоПланирования - ПеречислениеСсылка.Периодичность
// 
// Возвращаемое значение:
//  Дата
//
Функция ДатаОкончанияДолгосрочногоПланирования(Знач ДатаОкончанияПланированияПоДням, Знач ПериодовДолгосрочногоПланирования,
	Знач ПериодичностьДолгосрочногоПланирования) Экспорт
	
	Если ПериодовДолгосрочногоПланирования = 0 ИЛИ НЕ ЗначениеЗаполнено(ПериодичностьДолгосрочногоПланирования) Тогда
		Возврат '00010101';
	КонецЕсли;
	
	Дата = РаботаСПериодамиКлиентСервер.ДобавитьИнтервал(ДатаОкончанияПланированияПоДням,
		ПериодичностьДолгосрочногоПланирования, ПериодовДолгосрочногоПланирования);
	
	Возврат РаботаСПериодамиКлиентСервер.ДатаКонцаПериода(Дата, ПериодичностьДолгосрочногоПланирования);
	
КонецФункции

// Получает конечную дату планирования.
// 
// Параметры:
//  ПериодовДолгосрочногоПланирования - Число
//  ДатаОкончанияПланированияПоДням - Дата
//  ДатаОкончанияДолгосрочногоПланирования - Дата
// 
// Возвращаемое значение:
//  Дата
//
Функция ДатаОкончания(Знач ПериодовДолгосрочногоПланирования, Знач ДатаОкончанияПланированияПоДням,
	Знач ДатаОкончанияДолгосрочногоПланирования) Экспорт
	
	Возврат ?(ПериодовДолгосрочногоПланирования = 0, ДатаОкончанияПланированияПоДням, ДатаОкончанияДолгосрочногоПланирования);
	
КонецФункции

Процедура ПересчитатьДолгосрочныеПериодыВПодчиненныхСтрокахДерева(СтрокаДерева, Знач ПериодовДолгосрочногоПланирования,
	Знач ДнейПланирования) Экспорт
	
	Если ПериодовДолгосрочногоПланирования = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоследнийДеньСОборотами = 0;
	Индекс = ДнейПланирования;
	Пока Индекс >= 1 Цикл
		Если СтрокаДерева["День" + Индекс] <> 0 Тогда
			ПоследнийДеньСОборотами = Индекс;
			Прервать;
		КонецЕсли;
		Индекс = Индекс - 1
	КонецЦикла;
	
	Если СтрокаДерева.ВидСтроки = 0 Или СтрокаДерева.ВидСтроки = 4 Тогда // Остаток в валюте ДС, либо в валюте платежа
		
		НачальныйОстаток = ?(ПоследнийДеньСОборотами > 0, СтрокаДерева["День" + ПоследнийДеньСОборотами],
			СтрокаДерева.Остаток);
		
		Для Инд = 1 По ПериодовДолгосрочногоПланирования Цикл
			ИмяКолонки = "ДолгосрочныйПериод" + Инд;
			СтрокаДерева[ИмяКолонки] = НачальныйОстаток + СтрокаДерева[ИмяКолонки + "ВВалюте"];
			НачальныйОстаток = СтрокаДерева[ИмяКолонки];
			
			Если СтрокаДерева.ВидСтроки = 0 Тогда
				СтрокаДерева[ИмяКолонки + "ОшибкаКритическийОстаток"] = (НачальныйОстаток <= СтрокаДерева.КритическийОстаток)
					И СтрокаДерева.КритическийОстаток > 0
					И НачальныйОстаток > 0;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли СтрокаДерева.ВидСтроки = 2 Тогда // Остаток в одной валюте
		
		НачальныйОстаток = ?(ПоследнийДеньСОборотами > 0, СтрокаДерева["День" + ПоследнийДеньСОборотами],
			СтрокаДерева.ОстатокВОднойВалюте);
		
		Для Инд = 1 По ПериодовДолгосрочногоПланирования Цикл
			ИмяКолонки = "ДолгосрочныйПериод" + Инд;
			СтрокаДерева[ИмяКолонки] = НачальныйОстаток + СтрокаДерева[ИмяКолонки + "ВОднойВалюте"];
			НачальныйОстаток = СтрокаДерева[ИмяКолонки];
		КонецЦикла;
		
	ИначеЕсли СтрокаДерева.ВидСтроки = 1 Тогда // Оборот в валюте ДС, либо в валюте платежа
		
		Для Инд = 1 По ПериодовДолгосрочногоПланирования Цикл
			ИмяКолонки = "ДолгосрочныйПериод" + Инд;
			СтрокаДерева[ИмяКолонки] = СтрокаДерева[ИмяКолонки + "ВВалюте"];
		КонецЦикла;
		
	ИначеЕсли СтрокаДерева.ВидСтроки = 3 Тогда // Оборот в одной валюте
		
		Для Инд = 1 По ПериодовДолгосрочногоПланирования Цикл
			ИмяКолонки = "ДолгосрочныйПериод" + Инд;
			СтрокаДерева[ИмяКолонки] = СтрокаДерева[ИмяКолонки + "ВОднойВалюте"];
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
		Строки = СтрокаДерева.ПолучитьЭлементы();
	Иначе
		Строки = СтрокаДерева.Строки;
	КонецЕсли;
		
	Для Каждого СтрокаДерева Из Строки Цикл
		ПересчитатьДолгосрочныеПериодыВПодчиненныхСтрокахДерева(СтрокаДерева, ПериодовДолгосрочногоПланирования, 
			ДнейПланирования);
	КонецЦикла;
	
КонецПроцедуры

// Заполнение дат окончания планирования.
// 
// Параметры:
//  Объект - ОбработкаОбъект.ПлатежныйКалендарь
//
Процедура ЗаполнитьДатыОкончания(Объект) Экспорт
	
	Объект.ДатаОкончанияПланированияПоДням = ДатаОкончанияПланированияПоДням(
		Объект.ПланироватьСДаты, Объект.ДнейПланирования);
	Объект.ДатаОкончанияДолгосрочногоПланирования = ДатаОкончанияДолгосрочногоПланирования(
		Объект.ДатаОкончанияПланированияПоДням, Объект.ПериодовДолгосрочногоПланирования,
		Объект.ПериодичностьДолгосрочногоПланирования);
	Объект.ДатаОкончания = ДатаОкончания(Объект.ПериодовДолгосрочногоПланирования,
		Объект.ДатаОкончанияПланированияПоДням, Объект.ДатаОкончанияДолгосрочногоПланирования);
	
КонецПроцедуры

Процедура ИнициализироватьКомпоновщикНастроек(КомпоновщикОтбор, УникальныйИдентификаторФормы = Неопределено,
	НастройкиОтбора = Неопределено) Экспорт

	СхемаКомпоновкиДанных = ПолучитьМакет("ДеревоПлатежей");

	Если УникальныйИдентификаторФормы = Неопределено Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
	КонецЕсли;
	АдресВХранилище = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификаторФормы);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХранилище);
	
	КомпоновщикОтбор.Инициализировать(ИсточникНастроек);
	
	КомпоновщикОтбор.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Если НастройкиОтбора <> Неопределено Тогда
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(КомпоновщикОтбор.Настройки.Отбор, НастройкиОтбора.Отбор);
	КонецЕсли;
	
	КомпоновщикОтбор.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	Если УникальныйИдентификаторФормы = Неопределено Тогда
		УдалитьИзВременногоХранилища(АдресВХранилище);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаморозитьВернутьНаИсполнениеПлатежи(Параметры, АдресРезультата) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		Для Каждого Платеж Из Параметры.Платежи Цикл
		
			Запись = РегистрыСведений.ГрафикПлатежей.СоздатьМенеджерЗаписи();
			Запись.Заполнить(Неопределено);
			ЗаполнитьЗначенияСвойств(Запись, Платеж);
			Запись.Прочитать();
			
			Если Запись.Выбран() Тогда
				Запись.Заморожен = Параметры.Заморожен;
				
				Если НЕ Параметры.Заморожен Тогда
					Запись.ДатаПлатежа = Параметры.ДатаПлатежа;
				КонецЕсли;
				Запись.Записать();
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
			
		ТекстСообщения = НСтр("ru = 'Не удалось обработать платежи по причине: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;

КонецПроцедуры

Процедура ПеренестиОбъектОплаты(ОбъектОплаты, ПланироватьСДаты)
	
	ЗаписьПлатежаПолучена = Ложь;
	
	Для Каждого ЭлементПереноса Из ОбъектОплаты.Значение Цикл

		Если ЭлементПереноса.Коэффициент > 0 Тогда
			
			Попытка
				БлокировкаДанных = Новый БлокировкаДанных;
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ГрафикПлатежей");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("ОбъектОплаты", ЭлементПереноса.ОбъектОплаты);
				ЭлементБлокировки.УстановитьЗначение("БанковскийСчетКасса", ЭлементПереноса.БанковскийСчетКасса);
				ЭлементБлокировки.УстановитьЗначение("ДатаПлатежа", ЭлементПереноса.ДатаПлатежа);
				ЭлементБлокировки.УстановитьЗначение("ПлательщикПолучатель", ЭлементПереноса.ПлательщикПолучатель);
				ЭлементБлокировки.УстановитьЗначение("Организация", ЭлементПереноса.Организация);
				ЭлементБлокировки.УстановитьЗначение("ТипСуммы", ЭлементПереноса.ТипСуммы);
				ЭлементБлокировки.УстановитьЗначение("ПоступлениеСписание", ЭлементПереноса.ПоступлениеСписание);
				ЭлементБлокировки.УстановитьЗначение("Валюта", ЭлементПереноса.Валюта);
				БлокировкаДанных.Заблокировать();
			Исключение
				ВызватьИсключение;
			КонецПопытки;
	
			ЗаписьПлатежа = РегистрыСведений.ГрафикПлатежей.СоздатьМенеджерЗаписи();
			ЗаписьПлатежа.Заполнить(Неопределено);
			ЗаполнитьЗначенияСвойств(ЗаписьПлатежа, ЭлементПереноса);
			ЗаписьПлатежа.Прочитать();
				
			ЗаписьПлатежаПолучена = ЗаписьПлатежа.Выбран();
			
		ИначеЕсли ЗаписьПлатежаПолучена Тогда
			
			Если ЗначениеЗаполнено(ЭлементПереноса.БанковскийСчетКасса) Тогда
			
				Если ЭлементПереноса.ЭтоРазбиение Тогда
			
					СуммаРазницы = ЭлементПереноса.СуммаПереноса;
			
					НоваяЗапись = РегистрыСведений.ГрафикПлатежей.СоздатьМенеджерЗаписи();
					НоваяЗапись.Заполнить(Неопределено);
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьПлатежа, ,
						"БанковскийСчетКасса, ДатаПлатежа, Сумма, Идентификатор");
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ЭлементПереноса, "БанковскийСчетКасса, ДатаПлатежа");
					НоваяЗапись.Идентификатор = Новый УникальныйИдентификатор();
					НоваяЗапись.Сумма = СуммаРазницы;
					НоваяЗапись.Записать();
					
					ЗаписьПлатежа.Сумма = ЗаписьПлатежа.Сумма - СуммаРазницы;
				Иначе
					ЗаписьПлатежа.БанковскийСчетКасса = ЭлементПереноса.БанковскийСчетКасса;
					
					Если ЗначениеЗаполнено(ЭлементПереноса.ДатаПлатежа) Тогда
						ЗаписьПлатежа.ДатаПлатежа = ЭлементПереноса.ДатаПлатежа;
					КонецЕсли;
					ЗаписьПлатежа.Сумма = ЭлементПереноса.СуммаПереноса;
				КонецЕсли;
				
				ЗаписьПлатежа.Записать();
			Иначе
				Если ЗначениеЗаполнено(ЭлементПереноса.ДатаПлатежа) Тогда

					ЗаполнитьЗначенияСвойств(ЗаписьПлатежа, ЭлементПереноса, "БанковскийСчетКасса, ДатаПлатежа");
					ЗаписьПлатежа.Сумма = ЭлементПереноса.СуммаПереноса;
					ЗаписьПлатежа.Записать();
				Иначе
					Записи = РегистрыСведений.ГрафикПлатежей.СоздатьНаборЗаписей();
					Записи.Заполнить(Неопределено);
					Записи.Отбор.ОбъектОплаты.Установить(ЗаписьПлатежа.ОбъектОплаты);
					Записи.Прочитать();
					
					Для Каждого Запись Из Записи Цикл
						
						Запись.БанковскийСчетКасса = Запись.ИсходныйБанковскийСчетКасса;
						Запись.ДатаПлатежа = Запись.ИсходнаяДатаПлатежа;
						Запись.Сумма = Запись.ИсходнаяСумма;
					КонецЦикла;
					
					ТаблицаЗаписи = Записи.Выгрузить();
					ТаблицаЗаписи.Свернуть("ОбъектОплаты, БанковскийСчетКасса, ДатаПлатежа, ПлательщикПолучатель,
						|Организация, ТипСуммы, ПоступлениеСписание, Валюта, Сумма, СтатьяДвиженияДенежныхСредств,
						|ХозяйственнаяОперация, ОбластьПланирования, Подразделение, НаправлениеДеятельности, Приоритет,
						|Ответственный, ТипОбъектаОплаты, Номер, Дата, СуммаДокумента, ФормаОплаты, ДатаАктуальностиГрафика,
						|КорВалюта, Статус, Заморожен, ИсходныйБанковскийСчетКасса, ИсходнаяДатаПлатежа, ИсходнаяСумма");
					
					Записи.Загрузить(ТаблицаЗаписи);
					
					Для Каждого Запись Из Записи Цикл 
						Запись.Идентификатор = Новый УникальныйИдентификатор();
					КонецЦикла;
					
					Если Записи.Количество() > 0 Тогда
						Записи.Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеПлатежейПоИдентификаторам(Идентификаторы)

	Результат = Новый Структура("ЗаявкиНаОплату, ИдентификаторыНеЗаявки");

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ГрафикПлатежей.Идентификатор КАК Идентификатор,
	|	Заявки.Ссылка КАК Заявка
	|
	|ПОМЕСТИТЬ Платежи
	|
	|ИЗ
	|	РегистрСведений.ГрафикПлатежей КАК ГрафикПлатежей
	|	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявки
	|ПО
	|	Заявки.Ссылка = ГрафикПлатежей.ОбъектОплаты
	|ГДЕ
	|	ГрафикПлатежей.Идентификатор В (&Идентификаторы)
	|;
	|
	|ВЫБРАТЬ
	|	Платежи.Заявка КАК Заявка
	|ИЗ
	|	Платежи
	|ГДЕ
	|	НЕ Платежи.Заявка ЕСТЬ NULL
	|;
	|
	|ВЫБРАТЬ
	|	Платежи.Идентификатор КАК Идентификатор
	|ИЗ
	|	Платежи
	|ГДЕ
	|	Платежи.Заявка ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат.ЗаявкиНаОплату = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Заявка");
	Результат.ИдентификаторыНеЗаявки = РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("Идентификатор");
	
	Возврат Результат;

КонецФункции

// Дата с которой будут показаны просроченные платежи.
// 
// Параметры:
//  ПланироватьСДаты - Дата.
//  ГлубинаОтображенияПросроченныхПлатежей - Число.
// 
// Возвращаемое значение:
//  Дата
//
Функция ДатаНачалаОтображенияПросроченныхПлатежей(ПланироватьСДаты, ГлубинаОтображенияПросроченныхПлатежей) Экспорт
	
	Возврат ?(ГлубинаОтображенияПросроченныхПлатежей = 0, '00010101',
		ПланироватьСДаты - 86400 * ГлубинаОтображенияПросроченныхПлатежей);
	
КонецФункции

#КонецОбласти

#КонецЕсли
